Import the necessary libraries

In [1]:
#Import Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
#Load the dataset 
df = pd.read_csv('Titanic-Dataset.csv')

Analyze the Data & Missing Values

In [5]:
#see information about the data by using info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
#see the description of the data such as mean median etc by using describe()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
#see the first five data of the dataset by using head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
#see the last five data of the dataset by using tail()
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [13]:
#Now check for any Null values or missinf values by using isnull() 
print(df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Age has 177 missing values ,
Cabin has 687 missing values ,
Embarked has 2 missing values.

Handle Missing Values

In [15]:
# now removing or filling with mean / median bvalues foe particular feature
#here Age feature is numerical feature hence we have fill with the mean
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [17]:
print(df['Age'].isnull().sum())

0

In [19]:
#Cabin (categorical with many nulls): Drop the column
#Because over 77% of the values are missing, itâ€™s better to drop it.
df.drop(columns=['Cabin'], inplace=True)

In [25]:
#Embarked (categorical data): Fill with mode
df['Embarked']=df['Embarked'].fillna(df['Embarked'].mode()[0])

In [27]:
df['Embarked'].isnull().sum()

0

In [29]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

Drop Unnecessary Columns
Some columns like PassengerId, Name, Ticket may not help the predictions.

In [34]:
df.drop(columns=['PassengerId','Name','Ticket'],inplace=True)

Encode Categorical Variables

In [37]:
#Sex: Label Encoding
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['Sex'] = le.fit_transform(df['Sex'])

In [39]:
#Embarked: One-Hot Encoding
df = pd.get_dummies(df, columns=['Embarked'], drop_first=True)

Feature Scaling

In [42]:
#Standardize Age and Fare
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
df[['Age', 'Fare']] = scaler.fit_transform(df[['Age', 'Fare']])

Outlier Removal

In [45]:
Q1 = df['Fare'].quantile(0.25)
Q3 = df['Fare'].quantile(0.75)
IQR = Q3 - Q1
df = df[(df['Fare'] >= Q1 - 1.5 * IQR) & (df['Fare'] <= Q3 + 1.5 * IQR)]

Final Check

In [50]:
df.isnull().sum()  # Should show 0

Survived      0
Pclass        0
Sex           0
Age           0
SibSp         0
Parch         0
Fare          0
Embarked_Q    0
Embarked_S    0
dtype: int64

In [52]:
df.info()          # Check data types

<class 'pandas.core.frame.DataFrame'>
Index: 775 entries, 0 to 890
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Survived    775 non-null    int64
 1   Pclass      775 non-null    int64
 2   Sex         775 non-null    int32
 3   Age         775 non-null    float64
 4   SibSp       775 non-null    int64
 5   Parch       775 non-null    int64
 6   Fare        775 non-null    float64
 7   Embarked_Q  775 non-null    bool
 8   Embarked_S  775 non-null    bool
dtypes: bool(2), float64(2), int32(1), int64(4)
memory usage: 46.9 KB

In [54]:
df.head()          # Preview the cleaned data

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_Q,Embarked_S
0,0,3,1,-0.592481,1,0,-0.502445,False,True
2,1,3,0,-0.284663,0,0,-0.488854,False,True
3,1,1,0,0.407926,1,0,0.420730,False,True
4,0,3,1,0.407926,0,0,-0.486337,False,True
5,0,3,1,0.000000,0,0,-0.478116,True,False

In [56]:
#saved the preprocessed data
df.to_csv('titanic_cleaned.csv', index=False)